local M = {

-------------固定配置部分--------------

nparam = { --这里填的数字每个number参数必发
	-1,
	0,
	0xFFFFFFFF,
	0xFFFF,
	0xFFFFFFFFFFFFFFFF,
	0xFFFFFFFFFFFFFFFF >> 1,
	-9223372036854775808,
	1844674407370955161,
	--2.2250738585072014e-308,
	--1.7976931348623158e+308
},

sparam = { --这里填的字符串每个string 参数必发
	"inset into player where player id=%d;",
	"delete from player;",
},


------------------------随机配置部分--------------------------

rnparam = { --这里填的数字, 随机这个区间发
{ -2147483647,  2147483647},
{ 0,  4294967295},
{-9223372036854775808, 1844674407370955161}
--{2.2250738585072014e-308,  1.7976931348623158e+308}
},

rsmaram = { --这里填的之母string 参数随机组合
"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
},

rslen = 65535 - 30, --字符串参数随机长度

}




return M